# **DS6001: Lab Assignment 6**
## **Randa Ampah**

In [57]:
import numpy as np
import pandas as pd
import requests
import json
import sqlite3
import psycopg
import mysql.connector
from sqlalchemy import create_engine
import pymongo
from bson.json_util import loads, dumps
import dotenv
import os
import warnings

warnings.filterwarnings('ignore')

## Problem 1

### Part A

1. There are 3 containers being launched when the compose.yaml file is executed.

2. The mysql container runs MySQL, the postgres container runs PostgreSQL, and the mongo container runs MongoDB. All of these containers also connects a port, connects to the .env file in the directory, saves the files and data somewhere on the local directory using the volumes key.

3. These Docker images are stored on the DockerHub website.

### Part B

In [46]:
'''
Client:
 Version:           28.4.0
 API version:       1.51
 Go version:        go1.24.7
 Git commit:        d8eb465
 Built:             Wed Sep  3 20:56:26 2025
 OS/Arch:           darwin/arm64
 Context:           desktop-linux

Server: Docker Desktop 4.46.0 (204649)
 Engine:
  Version:          28.4.0
  API version:      1.51 (minimum version 1.24)
  Go version:       go1.24.7
  Git commit:       249d679
  Built:            Wed Sep  3 20:58:53 2025
  OS/Arch:          linux/arm64
  Experimental:     false
 containerd:
  Version:          1.7.27
  GitCommit:        05044ec0a9a75232cad458027ca83437aae3f4da
 runc:
  Version:          1.2.5
  GitCommit:        v1.2.5-0-g59923ef
 docker-init:
  Version:          0.19.0
  GitCommit:        de40ad0`

'''

'\nClient:\n Version:           28.4.0\n API version:       1.51\n Go version:        go1.24.7\n Git commit:        d8eb465\n Built:             Wed Sep  3 20:56:26 2025\n OS/Arch:           darwin/arm64\n Context:           desktop-linux\n\nServer: Docker Desktop 4.46.0 (204649)\n Engine:\n  Version:          28.4.0\n  API version:      1.51 (minimum version 1.24)\n  Go version:       go1.24.7\n  Git commit:       249d679\n  Built:            Wed Sep  3 20:58:53 2025\n  OS/Arch:          linux/arm64\n  Experimental:     false\n containerd:\n  Version:          1.7.27\n  GitCommit:        05044ec0a9a75232cad458027ca83437aae3f4da\n runc:\n  Version:          1.2.5\n  GitCommit:        v1.2.5-0-g59923ef\n docker-init:\n  Version:          0.19.0\n  GitCommit:        de40ad0`\n\n'

### Part C

In [42]:
dotenv.load_dotenv()

True

### Part D

[+] Running 4/4

 ✔ Network ds6001databases_default       Created                                                                    0.0s 

 ✔ Container ds6001databases-mysql-1     Created                                                                    0.1s 

 ✔ Container ds6001databases-postgres-1  Created                                                                    0.1s 

 ✔ Container ds6001databases-mongo-1     Created                                                                    0.1s 

Attaching to mongo-1, mysql-1, postgres-1

### Part E

In [43]:
# 1. Load needed environment variables
dotenv.load_dotenv()
POSTGRES_PASSWORD = os.getenv('POSTGRES_PASSWORD')
MONGO_INITDB_ROOT_USERNAME = os.getenv('MONGO_INITDB_ROOT_USERNAME')
MONGO_INITDB_ROOT_PASSWORD = os.getenv('MONGO_INITDB_ROOT_PASSWORD')
MYSQL_ROOT_PASSWORD = os.getenv('MYSQL_ROOT_PASSWORD')
# 2. Test MySQL
dbserver = mysql.connector.connect(
 user='root',
 password=MYSQL_ROOT_PASSWORD,
 host='localhost',
 port='3306',
 #auth_plugin='mysql_native_password'
)
# 3. Test PostgreSQL
dbserver = psycopg.connect(
 user='postgres',
 password=POSTGRES_PASSWORD,
 host='localhost',
 port = '5432'
)
dbserver.autocommit = True
# 4. Test MongoDB
myclient = pymongo.MongoClient(f"mongodb://{MONGO_INITDB_ROOT_USERNAME}:{MONGO_INITDB_ROOT_PASSWORD}@localhost:27017/")
myclient.list_databases()

## Problem 2

In [88]:
drug_data = pd.read_csv('Patient prescriptions - Data.csv')
drug_data.head(3).T

,0,1,2
patient_name,Nkemdilim Arendonk,Nkemdilim Arendonk,Raniero Coumans
date_of_birth,2/21/1962,2/21/1962,8/15/1990
prescribed_drug,Amoxil,Micronase,Zosyn
prior_conditions,"[Pneumonia, Diabetes, Rubella]","[Pneumonia, Diabetes, Rubella]","[Appendicitis, Crohn's disease, Mononucleosis]"
patient_sex,M,M,M
patient_insurance,Aetna,Aetna,Cigna
drug_maker,USAntibiotics,Pfizer,Baxter International Inc
drug_cost,14.62,20.55,394.0
prescribing_physician,Earnest Caro,Earnest Caro,Pamela English
physician_medschool,University of California (Irvine),University of California (Irvine),University of Michigan
physician_years_experience,14,14,29
hospital,UPMC Presbyterian Shadyside,UPMC Presbyterian Shadyside,Northwestern Memorial Hospital
hospital_location,"Pittsburgh, PA","Pittsburgh, PA","Chicago, IL"

### Part A

The problem in the data keeping the table from being in first normal form is the prior_conditions column, because there are observations that contain more than one condition for one patient, which is non-atomic data.

A way to resolve this problem is to create a new table to contain the prior conditions data for each patient. This table would contain the patient_name, date_of_birth, and prior_conditions columns. Within this new table, we would also reorganize the data so that each row would only have one condition in the prior_conditions column. So each row would contain one unique patient name - date of birth - single prior condition combination. This table would contain more rows than the original data because there are patients with multiple conditions, which would be listed multiple times.

### Part B

An issue within the remaining data table is that drug_maker and drug_cost are not functionally dependent on all of the primary key columns. That data only depends on the drug. Another issue is that the patient information, such as patient_sex and patient_insurance, is only functionally dependent on patient_name and date_of_birth, but not prescribed_drug

To put the data into second normal form, 2 new tables would be created. The first one, containing drug information, would contain the prescribed_drug, drug_maker, and drug_cost columns with prescribed_drug as the primary key. The second one, containing patient information, would contain patient_name, date_of_birth, patient_sex, and patient_insurance, with patient_name and date_of_birth as the primary keys.

### Part C

A problem causing this table to not be in 3rd normal form is that there are columns that are dependent on the prescribing_physician column, which isn't a primary key. The same is the issue for the columns containing hospital data as the hospital is functionally dependent on prescribing_physician and hospital_location is functionally dependent on hospital.

This can be remedied by creating a new table containing physician and hospital data, which would include the columns prescribing_physician, physician_medschool, physician_years_experience, hospital. the prescribing_physician variable would be the primary key. Another table would then be created only containing hospital and hospital_location, with hospital as the primary key.

### Part D

In [90]:
# First Normal Form
conditions = drug_data[['patient_name','date_of_birth','prior_conditions']]
conditions['prior_conditions'] = conditions['prior_conditions'].str.strip('[]').str.split(', ').explode(ignore_index=True)

drug_data = drug_data.drop(['prior_conditions'], axis=1)

# Second Normal Form: Drugs and Patients
drugs = drug_data[['prescribed_drug','drug_maker','drug_cost']]
patients = drug_data[['patient_name','date_of_birth','patient_sex','patient_insurance']].drop_duplicates(ignore_index=True)

drug_data = drug_data.drop(['drug_maker','drug_cost','patient_sex','patient_insurance'], axis=1)

# Third Normal Form: Physicians and Hospitals

physicians = drug_data[['prescribing_physician','physician_medschool','physician_years_experience','hospital','hospital_location']].drop_duplicates()
hospitals = drug_data[['hospital','hospital_location']].drop_duplicates()

prescriptions = drug_data.drop(['physician_medschool','physician_years_experience','hospital','hospital_location'],axis=1)

In [91]:
conditions

         patient_name date_of_birth prior_conditions
0  Nkemdilim Arendonk     2/21/1962        Pneumonia
1  Nkemdilim Arendonk     2/21/1962         Diabetes
2     Raniero Coumans     8/15/1990          Rubella
3     Raniero Coumans     8/15/1990        Pneumonia
4     Mizuki Debenham     3/12/1977         Diabetes
5         Zoë De Witt    11/23/1947          Rubella
6         Zoë De Witt    11/23/1947     Appendicitis
7         Zoë De Witt    11/23/1947  Crohn's disease
8       Bonnie Hooper      7/4/1951    Mononucleosis
9       Bonnie Hooper      7/4/1951     Appendicitis

In [92]:
drugs

  prescribed_drug                drug_maker  drug_cost
0          Amoxil             USAntibiotics      14.62
1       Micronase                    Pfizer      20.55
2           Zosyn  Baxter International Inc     394.00
3          Humira                    Abbvie    7000.00
4          Inlyta                    Pfizer   21644.00
5        Atenolol     Mylan Pharmaceuticals      10.58
6       Micronase                    Pfizer      20.55
7         Demerol                    Pfizer      37.50
8          Xeloda                 Genentech     860.00
9         Demerol                    Pfizer      37.50

In [93]:
patients

         patient_name date_of_birth patient_sex       patient_insurance
0  Nkemdilim Arendonk     2/21/1962           M                   Aetna
1     Raniero Coumans     8/15/1990           M                   Cigna
2     Mizuki Debenham     3/12/1977           F       Kaiser Permanente
3         Zoë De Witt    11/23/1947           F                Medicare
4       Bonnie Hooper      7/4/1951           F  Blue Cross Blue Shield

In [94]:
physicians

,prescribing_physician,physician_medschool,physician_years_experience,hospital,hospital_location
0,Earnest Caro,University of California (Irvine),14,UPMC Presbyterian Shadyside,"Pittsburgh, PA"
2,Pamela English,University of Michigan,29,Northwestern Memorial Hospital,"Chicago, IL"
3,Samantha Bergerson,Johns Hopkins University,10,Northwestern Memorial Hospital,"Chicago, IL"
4,Lewis Conti,North Carolina State University,8,Houston Methodist Hospital,"Houston, TX"
5,Theresa Dahlmans,Lake Erie College of Medicine,17,Mount Sinai Hospital,"New York, NY"
6,Hilde Ali,Colorado University Boulder,11,Mount Sinai Hospital,"New York, NY"
8,Steven Garbutt,Ohio State University,36,UCSF Medical Center,"San Francisco, CA"

In [95]:
hospitals

                         hospital  hospital_location
0     UPMC Presbyterian Shadyside     Pittsburgh, PA
2  Northwestern Memorial Hospital        Chicago, IL
4      Houston Methodist Hospital        Houston, TX
5            Mount Sinai Hospital       New York, NY
8             UCSF Medical Center  San Francisco, CA

In [96]:
prescriptions

         patient_name date_of_birth prescribed_drug prescribing_physician
0  Nkemdilim Arendonk     2/21/1962          Amoxil          Earnest Caro
1  Nkemdilim Arendonk     2/21/1962       Micronase          Earnest Caro
2     Raniero Coumans     8/15/1990           Zosyn        Pamela English
3     Raniero Coumans     8/15/1990          Humira    Samantha Bergerson
4     Mizuki Debenham     3/12/1977          Inlyta           Lewis Conti
5         Zoë De Witt    11/23/1947        Atenolol      Theresa Dahlmans
6         Zoë De Witt    11/23/1947       Micronase             Hilde Ali
7         Zoë De Witt    11/23/1947         Demerol             Hilde Ali
8       Bonnie Hooper      7/4/1951          Xeloda        Steven Garbutt
9       Bonnie Hooper      7/4/1951         Demerol        Steven Garbutt

## Problem 3

In [97]:
repo = 'https://github.com/jkropko/DS-6001/raw/master/localdata/'
works = pd.read_csv(repo + 'Works.csv')
characters = pd.read_csv(repo + 'Characters.csv')
chapters = pd.read_csv(repo + 'Chapters.csv')
paragraphs = pd.read_csv(repo + 'Paragraphs.csv')

# convert column names to lowercase (needed for postgreSQL to work properly)
characters.columns = characters.columns.str.lower()
chapters.columns = chapters.columns.str.lower()
paragraphs.columns = paragraphs.columns.str.lower()
works.columns = works.columns.str.lower()

# works in the characters tables is a comma separated list.
# Break it out into multiple rows in a new table
charworks = characters[['charid', 'works']]
charworks.loc[:,'works'] = charworks['works'].str.split(',')
charworks = charworks.explode('works')
charworks = charworks.rename({'works':'workid'}, axis=1)
characters = characters.drop('works', axis=1)

# Remove empty rows
chapters = chapters.query("~chapterid.isnull()")
paragraphs = paragraphs.query("~paragraphid.isnull()")
charworks = charworks.query("~workid.isnull()")

# Add chapterid to paragraphs
paragraphs = pd.merge(paragraphs,
                      chapters.drop('description', axis=1),
                      how='inner',
                      on=['workid', 'section', 'chapter'])

# Remove unnecessary columns
paragraphs = paragraphs.drop(['paragraphtype', 'section', 'chapter'],
                             axis=1)

In [98]:
works.head()

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,NaN,Moby,19837,1031
1,allswell,All's Well That Ends Well,All's Well That Ends Well,1602,c,NaN,Moby,22997,1025
2,antonycleo,Antony and Cleopatra,Antony and Cleopatra,1606,t,NaN,Moby,24905,1344
3,asyoulikeit,As You Like It,As You Like It,1599,c,NaN,Gutenberg,21690,872
4,comedyerrors,Comedy of Errors,The Comedy of Errors,1589,c,NaN,Moby,14692,661

In [99]:
characters.head()

,charid,charname,abbrev,description,speechcount
0,1apparition-mac,First Apparition,First Apparition,NaN,1.0
1,1citizen,First Citizen,First Citizen,NaN,3.0
2,1conspirator,First Conspirator,First Conspirator,NaN,3.0
3,1gentleman-oth,First Gentleman,First Gentleman,NaN,1.0
4,1goth,First Goth,First Goth,NaN,4.0

In [100]:
paragraphs.head()

,workid,paragraphid,paragraphnum,charid,plaintext,phonetictext,stemtext,charcount,wordcount,chapterid
0,12night,630863,3,xxx,"[Enter DUKE ORSINO, CURIO, and other Lords; Mu...",ENTR TK ORSN KR ANT O0R LRTS MSXNS ATNTNK,enter duke orsino curio and other lord musicia...,65.0,9.0,18704.0
1,12night,630864,4,ORSINO,"If music be the food of love, play on;\n[p]Giv...",IF MSK B 0 FT OF LF PL ON JF M EKSSS OF IT 0T ...,if music be the food of love plai on give me e...,646.0,114.0,18704.0
2,12night,630865,19,CURIO,"Will you go hunt, my lord?\n",WL Y K HNT M LRT,will you go hunt my lord,27.0,6.0,18704.0
3,12night,630866,20,ORSINO,"What, Curio?\n",HT KR,what curio,13.0,2.0,18704.0
4,12night,630867,21,CURIO,The hart.\n,0 HRT,the hart,10.0,2.0,18704.0

### Part A

**Problem I**
1. The tables should be joined on the workid column.
2. Each row in charworks contains information on each unique character to work pairing. Each row in works contains information on one unique work of Shakespeare. Some of Shakespeare's works have multiple characters, meaning that multiple rows in charworks could map to the samw row in works.
3. There is a many-to-one relationship between the tables.
4. Ref: charworks.workid > works.workid

**Problem II**
1. The tables should be joined on the charid column.
2. Each observation in charworks would only map to one observation in the characters table because each character is unique in the character table. However, there are characters listed multiple times in the charworks table, since some charids are paired with multiple workid's, so each observation in characters could possibly map to more than one charid-workid pairing.
3. There is a one-to-many relationship between characters and charworks.
4. Ref: characters.charid < charworks.charid

**Problem III**
1. The tables should be joined on workid.
2. A row in works can map to many rows in paragraphs, because a work can have many paragraphs. However, a paragraph can only come from one work, so one row in paragraphs can only map to one row in works.
3. There is a one-to-many relationship between works and paragraphs.
4. Ref: works.workid < paragraphs.workid

**Problem IV**
1. The tables should be joined on workid.
2. A row in works can map to many rows in chapters, because a work can have multiple chapters. However, a chapter can only come from one specific work, so one row in chapters maps to one row in works.
3. There is a many-to-one relationship between chapters and works.
4. Ref: chapters.workid > works.workid

**Problem V**
1. The tables should be joined on the workid and chapterid columns.
2. Multiple rows in paragraphs can map to one row in chapters, because multiple lines can be in one chapter. However, one row in chapters only maps to one row in paragraphs, because a line can only have one chapter.
3. There is a many-to-one relationship between paragraphs and chapters.
4. - Ref: paragraphs.workid > chapters.workid 
   - Ref: paragraphs.chapterid > chapters.chapterid

**Problem VI**
1. The tables should be joined on the charid column.
2. Each row in characters can map to many rows in paragraphs because one character can have multiple lines. One row in paragraphs can only map to one row in characters, because only one character can say a line (assuming that groups are seen as one character)
3. There is a one-to-many relationship between characters and paragraphs.
4. Ref: characters.charid < paragraphs.charid

### Part B

In [117]:
def pandas_df_to_dbml(df: pd.DataFrame, table_name: str) -> str:
    """
    Converts a pandas DataFrame to a DBML string.

    Args:
        df: The pandas DataFrame to convert.
        table_name: The name of the table in the DBML schema.

    Returns:
        A DBML string representing the DataFrame schema.
    """

    dbml_string = f"Table {table_name} {{\n"

    for column_name, column_type in df.dtypes.items():
        dbml_type = map_pandas_dtype_to_dbml_type(column_type)
        dbml_string += f"  {column_name} {dbml_type}\n"

    dbml_string += "}\n"
    return dbml_string

def map_pandas_dtype_to_dbml_type(dtype) -> str:
    """Maps a pandas dtype to a DBML type."""
    dtype_name = str(dtype)
    if "int" in dtype_name:
      return "int"
    if "float" in dtype_name:
      return "float"
    if "datetime" in dtype_name:
        return "datetime"
    return "varchar"

**Link to ER diagram: <https://dbdocs.io/ampahranda03/Lab6_Shakespeare>**

In [207]:
#print(pandas_df_to_dbml(chapters,'chapters'))
#print(pandas_df_to_dbml(characters,'characters'))
#print(pandas_df_to_dbml(charworks,'charworks'))
#print(pandas_df_to_dbml(works,'works'))
#print(pandas_df_to_dbml(paragraphs,'paragraphs'))

```
Table chapters {
  workid varchar 
  chapterid float [pk]
  section float
  chapter float
  description varchar
}

Table characters {
  charid varchar [pk]
  charname varchar
  abbrev varchar
  description varchar
  speechcount float
}

Table charworks {
  charid varchar [pk]
  workid varchar [pk]
}

Table works {
  workid varchar [pk]
  title varchar
  longtitle varchar
  date int
  genretype varchar
  notes float
  source varchar
  totalwords int
  totalparagraphs int
}

Table paragraphs {
  workid varchar
  paragraphid varchar [pk]
  paragraphnum varchar
  charid varchar
  plaintext varchar
  phonetictext varchar
  stemtext varchar
  charcount float
  wordcount float
  chapterid float
}

Ref: charworks.workid > works.workid
Ref: characters.charid < charworks.charid
Ref: works.workid < paragraphs.workid
Ref: paragraphs.workid > chapters.workid 
Ref: paragraphs.chapterid > chapters.chapterid
Ref: characters.charid < paragraphs.charid
```

## Problem 4

### Part A

In [131]:
shake_db = sqlite3.connect('shakespeare.db')

In [132]:
works.to_sql('works', shake_db, index=False, chunksize=1000, if_exists='replace')
charworks.to_sql('charworks', shake_db, index=False, chunksize=1000, if_exists='replace')
paragraphs.to_sql('paragraphs', shake_db, index=False, chunksize=1000, if_exists='replace')
characters.to_sql('characters', shake_db, index=False, chunksize=1000, if_exists='replace')
chapters.to_sql('chapters', shake_db, index=False, chunksize=1000, if_exists='replace')

945

In [133]:
myquery = '''
SELECT charname, description, speechcount
FROM characters
WHERE speechcount > 200
'''
pd.read_sql_query(myquery, con=shake_db)

,charname,description,speechcount
0,Antony,(Marcus Antonius),253.0
1,Cleopatra,queen of Egypt,204.0
2,Falstaff,Sir John Falstaff,471.0
3,Duke of Gloucester,brother to the King,285.0
4,Hamlet,son of the former king and nephew to the prese...,358.0
5,Henry V,"Prince, King of England",377.0
6,Iago,Othello's ancient (?),272.0
7,Othello,A noble Moor in the service of the Ventian state,274.0
8,Poet,the voice of Shakespeare's poetry,733.0
9,Richard III,"son of Richard Plantagenet, duke of York; was ...",246.0
10,Rosalind,daughter to the banished Duke,201.0
11,Timon,None,210.0

In [134]:
shake_db.commit()
shake_db.close()

### Part B

In [140]:
# MySQL
dotenv.load_dotenv()
MYSQL_ROOT_PASSWORD = os.getenv('MYSQL_ROOT_PASSWORD')
dbserver = mysql.connector.connect(
    user='root', 
    password=MYSQL_ROOT_PASSWORD, 
    host='localhost',
    port='3306')

In [141]:
cursor = dbserver.cursor()

In [142]:
try:
    cursor.execute("CREATE DATABASE shakedb")
except:
    cursor.execute("DROP DATABASE shakedb")
    cursor.execute("CREATE DATABASE shakedb")

In [143]:
cursor.execute("SHOW DATABASES")
databases = cursor.fetchall()
databases

[('db',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('shakedb',),
 ('sys',)]

In [144]:
dbms = 'mysql'
package = 'mysqlconnector'
user = 'root'
password = MYSQL_ROOT_PASSWORD
host = 'localhost'
port = '3306'
db = 'shakedb'

engine = create_engine(f"{dbms}+{package}://{user}:{password}@{host}:{port}/{db}")
engine

Engine(mysql+mysqlconnector://root:***@localhost:3306/shakedb)

In [145]:
works.to_sql('works', con=engine, index=False, chunksize=1000, if_exists='replace')
charworks.to_sql('charworks', con=engine, index=False, chunksize=1000, if_exists='replace')
paragraphs.to_sql('paragraphs', con=engine, index=False, chunksize=1000, if_exists='replace')
characters.to_sql('characters', con=engine, index=False, chunksize=1000, if_exists='replace')
chapters.to_sql('chapters', con=engine, index=False, chunksize=1000, if_exists='replace')

945

In [146]:
myquery = '''
SELECT charname, description, speechcount
FROM characters
WHERE speechcount > 200
'''
pd.read_sql_query(myquery, con=engine)

,charname,description,speechcount
0,Antony,(Marcus Antonius),253.0
1,Cleopatra,queen of Egypt,204.0
2,Falstaff,Sir John Falstaff,471.0
3,Duke of Gloucester,brother to the King,285.0
4,Hamlet,son of the former king and nephew to the prese...,358.0
5,Henry V,"Prince, King of England",377.0
6,Iago,Othello's ancient (?),272.0
7,Othello,A noble Moor in the service of the Ventian state,274.0
8,Poet,the voice of Shakespeare's poetry,733.0
9,Richard III,"son of Richard Plantagenet, duke of York; was ...",246.0
10,Rosalind,daughter to the banished Duke,201.0
11,Timon,None,210.0

In [147]:
dbserver.commit()
dbserver.close()

### Part C

In [148]:
# PostgreSQL
POSTGRES_PASSWORD = os.getenv('POSTGRES_PASSWORD')
dbserver = psycopg.connect(
    user='postgres', 
    password=POSTGRES_PASSWORD, 
    host='localhost',
    port = '5432'
)

dbserver.autocommit = True

In [150]:
cursor = dbserver.cursor()

In [151]:
try:
    cursor.execute("CREATE DATABASE shakesdb")
except:
    cursor.execute("DROP DATABASE shakesdb")
    cursor.execute("CREATE DATABASE shakesdb")

In [152]:
cursor.execute("SELECT datname FROM pg_database")
databases = cursor.fetchall()
databases

[('postgres',), ('shakesdb',), ('template1',), ('template0',)]

In [153]:
dbms = 'postgresql'
package = 'psycopg'
user = 'postgres'
password = POSTGRES_PASSWORD
host = 'localhost'
port = '5432'
db = 'shakesdb'

engine = create_engine(f"{dbms}+{package}://{user}:{password}@{host}:{port}/{db}")
engine

Engine(postgresql+psycopg://postgres:***@localhost:5432/shakesdb)

In [154]:
works.to_sql('works', con=engine, index=False, chunksize=1000, if_exists='replace')
charworks.to_sql('charworks', con=engine, index=False, chunksize=1000, if_exists='replace')
paragraphs.to_sql('paragraphs', con=engine, index=False, chunksize=1000, if_exists='replace')
characters.to_sql('characters', con=engine, index=False, chunksize=1000, if_exists='replace')
chapters.to_sql('chapters', con=engine, index=False, chunksize=1000, if_exists='replace')

-1

In [155]:
myquery = '''
SELECT charname, description, speechcount
FROM characters
WHERE speechcount > 200
'''

pd.read_sql_query(myquery, con=engine)

,charname,description,speechcount
0,Antony,(Marcus Antonius),253.0
1,Cleopatra,queen of Egypt,204.0
2,Falstaff,Sir John Falstaff,471.0
3,Duke of Gloucester,brother to the King,285.0
4,Hamlet,son of the former king and nephew to the prese...,358.0
5,Henry V,"Prince, King of England",377.0
6,Iago,Othello's ancient (?),272.0
7,Othello,A noble Moor in the service of the Ventian state,274.0
8,Poet,the voice of Shakespeare's poetry,733.0
9,Richard III,"son of Richard Plantagenet, duke of York; was ...",246.0
10,Rosalind,daughter to the banished Duke,201.0
11,Timon,None,210.0

In [156]:
dbserver.commit()
dbserver.close()

## Problem 5

In [ ]:
# MongoDB

MONGO_INITDB_ROOT_USERNAME = os.getenv('MONGO_INITDB_ROOT_USERNAME')
MONGO_INITDB_ROOT_PASSWORD = os.getenv('MONGO_INITDB_ROOT_PASSWORD')

myclient = pymongo.MongoClient(f"mongodb://{MONGO_INITDB_ROOT_USERNAME}:{MONGO_INITDB_ROOT_PASSWORD}@localhost:27017/")
myclient.list_databases()

### Part A

In [185]:
history = myclient['history']

In [186]:
collist = history.list_collection_names()
if 'today' in collist:
    history.today.drop()
    
today = history['today']

In [180]:
history_pull = requests.get("https://history.muffinlabs.com/date")
history_json = json.loads(history_pull.text)
events = history_json['data']['Events']
events[0]

{'year': '690',
 'text': 'Empress Wu Zetian establishes the Zhou Dynasty of China.',
 'html': '690 - Empress <a href="https://wikipedia.org/wiki/Wu_Zetian" title="Wu Zetian">Wu Zetian</a> establishes the <a href="https://wikipedia.org/wiki/Zhou_dynasty_(690%E2%80%93705)" class="mw-redirect" title="Zhou dynasty (690-705)">Zhou Dynasty</a> of China.',
 'no_year_html': 'Empress <a href="https://wikipedia.org/wiki/Wu_Zetian" title="Wu Zetian">Wu Zetian</a> establishes the <a href="https://wikipedia.org/wiki/Zhou_dynasty_(690%E2%80%93705)" class="mw-redirect" title="Zhou dynasty (690-705)">Zhou Dynasty</a> of China.',
 'links': [{'title': 'Wu Zetian',
   'link': 'https://wikipedia.org/wiki/Wu_Zetian'},
  {'title': 'Zhou dynasty (690-705)',
   'link': 'https://wikipedia.org/wiki/Zhou_dynasty_(690%E2%80%93705)'}]}

### Part B

In [187]:
today.insert_many(events)

InsertManyResult([ObjectId('68f18a1c7a522583e65347de'), ObjectId('68f18a1c7a522583e65347df'), ObjectId('68f18a1c7a522583e65347e0'), ObjectId('68f18a1c7a522583e65347e1'), ObjectId('68f18a1c7a522583e65347e2'), ObjectId('68f18a1c7a522583e65347e3'), ObjectId('68f18a1c7a522583e65347e4'), ObjectId('68f18a1c7a522583e65347e5'), ObjectId('68f18a1c7a522583e65347e6'), ObjectId('68f18a1c7a522583e65347e7'), ObjectId('68f18a1c7a522583e65347e8'), ObjectId('68f18a1c7a522583e65347e9'), ObjectId('68f18a1c7a522583e65347ea'), ObjectId('68f18a1c7a522583e65347eb'), ObjectId('68f18a1c7a522583e65347ec'), ObjectId('68f18a1c7a522583e65347ed'), ObjectId('68f18a1c7a522583e65347ee'), ObjectId('68f18a1c7a522583e65347ef'), ObjectId('68f18a1c7a522583e65347f0'), ObjectId('68f18a1c7a522583e65347f1'), ObjectId('68f18a1c7a522583e65347f2'), ObjectId('68f18a1c7a522583e65347f3'), ObjectId('68f18a1c7a522583e65347f4'), ObjectId('68f18a1c7a522583e65347f5'), ObjectId('68f18a1c7a522583e65347f6'), ObjectId('68f18a1c7a522583e65347f7'), ObjectId('68f18a1c7a522583e65347f8'), ObjectId('68f18a1c7a522583e65347f9'), ObjectId('68f18a1c7a522583e65347fa'), ObjectId('68f18a1c7a522583e65347fb'), ObjectId('68f18a1c7a522583e65347fc'), ObjectId('68f18a1c7a522583e65347fd'), ObjectId('68f18a1c7a522583e65347fe'), ObjectId('68f18a1c7a522583e65347ff'), ObjectId('68f18a1c7a522583e6534800'), ObjectId('68f18a1c7a522583e6534801'), ObjectId('68f18a1c7a522583e6534802'), ObjectId('68f18a1c7a522583e6534803'), ObjectId('68f18a1c7a522583e6534804'), ObjectId('68f18a1c7a522583e6534805'), ObjectId('68f18a1c7a522583e6534806'), ObjectId('68f18a1c7a522583e6534807'), ObjectId('68f18a1c7a522583e6534808'), ObjectId('68f18a1c7a522583e6534809'), ObjectId('68f18a1c7a522583e653480a'), ObjectId('68f18a1c7a522583e653480b'), ObjectId('68f18a1c7a522583e653480c'), ObjectId('68f18a1c7a522583e653480d'), ObjectId('68f18a1c7a522583e653480e'), ObjectId('68f18a1c7a522583e653480f'), ObjectId('68f18a1c7a522583e6534810'), ObjectId('68f18a1c7a522583e6534811'), ObjectId('68f18a1c7a522583e6534812'), ObjectId('68f18a1c7a522583e6534813'), ObjectId('68f18a1c7a522583e6534814'), ObjectId('68f18a1c7a522583e6534815'), ObjectId('68f18a1c7a522583e6534816'), ObjectId('68f18a1c7a522583e6534817'), ObjectId('68f18a1c7a522583e6534818'), ObjectId('68f18a1c7a522583e6534819'), ObjectId('68f18a1c7a522583e653481a')], acknowledged=True)

### Part C

In [194]:
query = {
 "text":{
 "$regex": 'England'
 }
}

In [199]:
eng_events = today.find(query) 
for e in eng_events:
    print(e)

{'_id': ObjectId('68f18a1c7a522583e65347e7'), 'year': '1660', 'text': 'The nine regicides who signed the death warrant of Charles I of England are hanged, drawn and quartered.', 'html': '1660 - The <a href="https://wikipedia.org/wiki/List_of_regicides_of_Charles_I" title="List of regicides of Charles I">nine regicides</a> who signed the death warrant of <a href="https://wikipedia.org/wiki/Charles_I_of_England" title="Charles I of England">Charles I of England</a> are hanged, drawn and quartered.', 'no_year_html': 'The <a href="https://wikipedia.org/wiki/List_of_regicides_of_Charles_I" title="List of regicides of Charles I">nine regicides</a> who signed the death warrant of <a href="https://wikipedia.org/wiki/Charles_I_of_England" title="Charles I of England">Charles I of England</a> are hanged, drawn and quartered.', 'links': [{'title': 'List of regicides of Charles I', 'link': 'https://wikipedia.org/wiki/List_of_regicides_of_Charles_I'}, {'title': 'Charles I of England', 'link': 'https://wikipedia.org/wiki/Charles_I_of_England'}]}
{'_id': ObjectId('68f18a1c7a522583e65347e8'), 'year': '1662', 'text': 'Charles II of England sells Dunkirk to Louis XIV of France for 40,000 pounds.', 'html': '1662 - <a href="https://wikipedia.org/wiki/Charles_II_of_England" title="Charles II of England">Charles II of England</a> <a href="https://wikipedia.org/wiki/Sale_of_Dunkirk" title="Sale of Dunkirk">sells Dunkirk</a> to <a href="https://wikipedia.org/wiki/Louis_XIV" title="Louis XIV">Louis XIV</a> of France for 40,000 pounds.', 'no_year_html': '<a href="https://wikipedia.org/wiki/Charles_II_of_England" title="Charles II of England">Charles II of England</a> <a href="https://wikipedia.org/wiki/Sale_of_Dunkirk" title="Sale of Dunkirk">sells Dunkirk</a> to <a href="https://wikipedia.org/wiki/Louis_XIV" title="Louis XIV">Louis XIV</a> of France for 40,000 pounds.', 'links': [{'title': 'Charles II of England', 'link': 'https://wikipedia.org/wiki/Charles_II_of_England'}, {'title': 'Sale of Dunkirk', 'link': 'https://wikipedia.org/wiki/Sale_of_Dunkirk'}, {'title': 'Louis XIV', 'link': 'https://wikipedia.org/wiki/Louis_XIV'}]}
{'_id': ObjectId('68f18a1c7a522583e6534800'), 'year': '1956', 'text': 'The first commercial nuclear power station is officially opened by Queen Elizabeth II in Sellafield, England.', 'html': '1956 - The first commercial nuclear power station is officially opened by Queen Elizabeth II in <a href="https://wikipedia.org/wiki/Sellafield" title="Sellafield">Sellafield</a>, England.', 'no_year_html': 'The first commercial nuclear power station is officially opened by Queen Elizabeth II in <a href="https://wikipedia.org/wiki/Sellafield" title="Sellafield">Sellafield</a>, England.', 'links': [{'title': 'Sellafield', 'link': 'https://wikipedia.org/wiki/Sellafield'}]}

In [200]:
today.count_documents(query)

3

In [204]:
def mongo_query(collection, row_query={}, col_query={}):
    find = collection.find(row_query, col_query)
    find_dump = dumps(find)
    find_loads = loads(find_dump)
    return find_loads

In [206]:
results = mongo_query(today, 
            row_query=query, 
            col_query={})
results

[{'_id': ObjectId('68f18a1c7a522583e65347e7'),
  'year': '1660',
  'text': 'The nine regicides who signed the death warrant of Charles I of England are hanged, drawn and quartered.',
  'html': '1660 - The <a href="https://wikipedia.org/wiki/List_of_regicides_of_Charles_I" title="List of regicides of Charles I">nine regicides</a> who signed the death warrant of <a href="https://wikipedia.org/wiki/Charles_I_of_England" title="Charles I of England">Charles I of England</a> are hanged, drawn and quartered.',
  'no_year_html': 'The <a href="https://wikipedia.org/wiki/List_of_regicides_of_Charles_I" title="List of regicides of Charles I">nine regicides</a> who signed the death warrant of <a href="https://wikipedia.org/wiki/Charles_I_of_England" title="Charles I of England">Charles I of England</a> are hanged, drawn and quartered.',
  'links': [{'title': 'List of regicides of Charles I',
    'link': 'https://wikipedia.org/wiki/List_of_regicides_of_Charles_I'},
   {'title': 'Charles I of England',
    'link': 'https://wikipedia.org/wiki/Charles_I_of_England'}]},
 {'_id': ObjectId('68f18a1c7a522583e65347e8'),
  'year': '1662',
  'text': 'Charles II of England sells Dunkirk to Louis XIV of France for 40,000 pounds.',
  'html': '1662 - <a href="https://wikipedia.org/wiki/Charles_II_of_England" title="Charles II of England">Charles II of England</a> <a href="https://wikipedia.org/wiki/Sale_of_Dunkirk" title="Sale of Dunkirk">sells Dunkirk</a> to <a href="https://wikipedia.org/wiki/Louis_XIV" title="Louis XIV">Louis XIV</a> of France for 40,000 pounds.',
  'no_year_html': '<a href="https://wikipedia.org/wiki/Charles_II_of_England" title="Charles II of England">Charles II of England</a> <a href="https://wikipedia.org/wiki/Sale_of_Dunkirk" title="Sale of Dunkirk">sells Dunkirk</a> to <a href="https://wikipedia.org/wiki/Louis_XIV" title="Louis XIV">Louis XIV</a> of France for 40,000 pounds.',
  'links': [{'title': 'Charles II of England',
    'link': 'https://wikipedia.org/wiki/Charles_II_of_England'},
   {'title': 'Sale of Dunkirk',
    'link': 'https://wikipedia.org/wiki/Sale_of_Dunkirk'},
   {'title': 'Louis XIV', 'link': 'https://wikipedia.org/wiki/Louis_XIV'}]},
 {'_id': ObjectId('68f18a1c7a522583e6534800'),
  'year': '1956',
  'text': 'The first commercial nuclear power station is officially opened by Queen Elizabeth II in Sellafield, England.',
  'html': '1956 - The first commercial nuclear power station is officially opened by Queen Elizabeth II in <a href="https://wikipedia.org/wiki/Sellafield" title="Sellafield">Sellafield</a>, England.',
  'no_year_html': 'The first commercial nuclear power station is officially opened by Queen Elizabeth II in <a href="https://wikipedia.org/wiki/Sellafield" title="Sellafield">Sellafield</a>, England.',
  'links': [{'title': 'Sellafield',
    'link': 'https://wikipedia.org/wiki/Sellafield'}]}]